WB_VertCyl/WB_VertCyl_V11_VM/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

UMean 0 ;
internalField   uniform (0 0 0);

boundaryField
{

    inlet
    {
        type            waveVelocity;
        value           uniform (0 0 0);
    }
     outlet
    {
        type            waveVelocity;
        value           uniform (0 0 0);
    }
    top
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    GOWT
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    sides
    {
       type            slip;
      // type            cyclic;
    }

}
// ************************************************************************* //
